{"class_name": "Functional", "config": {"name": "model_30", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_54"}, "name": "input_54", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_53"}, "name": "input_53", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_52", "trainable": true, "dtype": "float32", "units": 6272, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_52", "inbound_nodes": [[["input_54", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_26", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 10, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_26", "inbound_nodes": [[["input_53", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_56", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_56", "inbound_nodes": [[["dense_52", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_51", "trainable": true, "dtype": "float32", "units": 49, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_51", "inbound_nodes": [[["embedding_26", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_39", "trainable": true, "dtype": "float32", "target_shape": [7, 7, 128]}, "name": "reshape_39", "inbound_nodes": [[["leaky_re_lu_56", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_38", "trainable": true, "dtype": "float32", "target_shape": [7, 7, 1]}, "name": "reshape_38", "inbound_nodes": [[["dense_51", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_25", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_25", "inbound_nodes": [[["reshape_39", 0, 0, {}], ["reshape_38", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_24", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_24", "inbound_nodes": [[["concatenate_25", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_57", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_57", "inbound_nodes": [[["conv2d_transpose_24", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_25", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_25", "inbound_nodes": [[["leaky_re_lu_57", 0, 0, {}]]]}], "input_layers": [["input_54", 0, 0], ["input_53", 0, 0]], "output_layers": [["conv2d_transpose_25", 0, 0]]}, "keras_version": "2.11.0", "backend": "tensorflow"}